In [ ]:
import pandas as pd

In [7]:

dict={
    "car":["maruti","tata","bmw",'volvo'],
    "mileage":[18,28,30,40],
}
df=pd.DataFrame(dict)
print(df)
print(df.to_string)

      car  mileage
0  maruti       18
1    tata       28
2     bmw       30
3   volvo       40
<bound method DataFrame.to_string of       car  mileage
0  maruti       18
1    tata       28
2     bmw       30
3   volvo       40>

In [9]:

data={
    "pressure":{
        "a":100,
        "b":150,
        "c":180,
        "d":120,
    },
    "sugar":
        {
        "a":120,
        "b":140,
        "c":380,
        "d":220,  
        }
}
df=pd.DataFrame(data)
print(df)
print(data)

   pressure  sugar
a       100    120
b       150    140
c       180    380
d       120    220
{'pressure': {'a': 100, 'b': 150, 'c': 180, 'd': 120}, 'sugar': {'a': 120, 'b': 140, 'c': 380, 'd': 220}}

In [19]:
data=pd.read_csv("temp1.csv")
print(data)
print(data.head(2))
print(data.tail(2))
print(data.info())
x=data["Total"].mean()
print(x)

  Name   roll   Eng   Math   Beng  Total        Avg
0     A     11    66     67    78    211  70.333333
1     B     12    45     45    67    157  52.333333
2     C     13    56     56    78    190  63.333333
3     D     14    67     67    89    223  74.333333
4     E     15    55     88    56    199  66.333333
  Name   roll   Eng   Math   Beng  Total        Avg
0     A     11    66     67    78    211  70.333333
1     B     12    45     45    67    157  52.333333
  Name   roll   Eng   Math   Beng  Total        Avg
3     D     14    67     67    89    223  74.333333
4     E     15    55     88    56    199  66.333333
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   roll    5 non-null      int64
 2   Eng     5 non-null      int64
 3   Math    5 non-null      int64
 4   Beng    5 non-null      int64
 5   Total   5 non-null      int64
 6   Avg     5 non-null      float64
dtypes: float64(1), int64(5), object(1)
memory usage: 412.0+ bytes
None
196.0

In [27]:
data=pd.read_csv("VAC.csv")
data

    roll no.      name   marks result
0          1    Shibham     50   Pass
1          2      Sujit     30   Fail
2          3  Souradeep     45   Pass
3          4     Ankita     98   Pass
4          5      Sneha     35   Fail
5          6       Dola     76   Pass
6          7      Sayan     23   Fail
7          8    Niladri     56   Pass
8          9      Ritik     78   Pass
9         10    Ibrahim     12   Fail
10        11     Apurbo     45   Pass

In [29]:
max = data[data['marks'] == data['marks'].max()]
print(max)

   roll no.   name   marks result
3         4  Ankita     98   Pass

In [36]:
data[data.marks>45]

   roll no.    name   marks result
0         1  Shibham     50   Pass
3         4   Ankita     98   Pass
5         6     Dola     76   Pass
7         8  Niladri     56   Pass
8         9    Ritik     78   Pass